#include<string.h>
typedef struct {
	char name1[20];//姓名
	int account1;//账号
	int password1;//密码
	int score1;//信用分
	int bNum1;//借书数量
	char bBook1[50];//借书名
}manager;

typedef struct {
	char name2[20];
	int account2;
	int password2;
	int score2;
	int bNum2;
	char bBook2[50];
}user;

manager managers[4]={
{"张明",20190108,208160,100,1,"《三国演义》"},
{"李华",20190102,208161,100,1,"《水浒传》"},
{"赵红",20190103,208162,100,2,"《西游记》"},
{"王玲",20190100,208263,100,1,"《红楼梦》"}};


user users[100]={
	{"张华",2021101002,102030,100,1,"《大学物理实验》"},
	{"王明",2021101001,102031,100,1,"《高等数学习题册》"},
	{"郭傲",2021101003,102032,100,1,"《计算机概论》"},
	{"汪洋",2021101000,102033,100,1,"《大学生创新创业设计》"},
	{"罗方",2021101005,102034,100,2,"《水浒传》，《西游记》"},
	{"张三",2021101010,902833,100,0,"无"},
	{"李四",2021101018,782321,100,0,"无"},
	{"赵五",2021101020,289832,100,0,"无"},
	{"王六",2021101007,829382,100,0,"无"},
	{"汪伦",2021101039,228329,100,0,"无"}};

typedef struct{
char name[40];//书名
char author[10];//作者
char type[20];//类别
int sum;//总量
int borrowed;//借出 数量
int remainder;//剩余 数量
int number;//编 号
}book;
 book books[100]={
{"《三国演义》","罗贯中","名著",2,0,2,1},
{"《西游记》","吴承恩","名著",2,0,2,2},
{"《水浒传》","施耐庵" ,"名著",2,0,2,3},
{"《红楼梦》","曹雪芹","名著",2,0,2,4},
{"《数据结构练习题》","万书振","计算机",3,0,3,5},
{"《英语四级练习题》","万书振" ,"英语",3,0,3,6},
{"《大学物理实验》","万书振" ,"大学物理",2,0,2,7},
{"《高等数学习题册》","万书振" ,"高等数学",3,0,3,8},
{"《计算机概论》","万书振","计算机",2,0,2,9},
{"《大学生创新创业设计》","万书振" ,"就业",2,0,2,10}};
